# Oracle TIMESTAMP Datatype â€“ Advanced & HR Scenarios
This notebook provides comprehensive examples for Oracle TIMESTAMP datatype, tested on Oracle APEX / LiveSQL.

### Sections
- Fundamentals
- HR Schema Scenarios
- Time Zone Handling
- Advanced Conversions
- Interview Challenges

In [ ]:
-- Section 1: Fundamentals (DUAL)
SELECT SYSTIMESTAMP AS system_ts, CURRENT_TIMESTAMP AS session_ts FROM DUAL;
SELECT SYSDATE AS system_date, SYSTIMESTAMP AS system_timestamp FROM DUAL;
SELECT TIMESTAMP '2025-10-05 14:35:55.123456' AS custom_ts FROM DUAL;
SELECT TIMESTAMP '2025-10-05 08:00:00 -05:00' AS ny_time,
       TIMESTAMP '2025-10-05 18:30:00 +05:30' AS india_time FROM DUAL;
SELECT SYSTIMESTAMP AS now,
       SYSTIMESTAMP + INTERVAL '2' DAY AS plus_2_days,
       SYSTIMESTAMP - INTERVAL '5' HOUR AS minus_5_hours FROM DUAL;

In [ ]:
-- Section 2: HR Schema Examples
SELECT ename, SYSDATE - hiredate AS days_since_hired FROM emp;
SELECT ename, FLOOR(MONTHS_BETWEEN(SYSDATE, hiredate)/12) AS years,
       MOD(MONTHS_BETWEEN(SYSDATE, hiredate),12) AS months FROM emp;
SELECT ename, hiredate FROM emp WHERE hiredate > ADD_MONTHS(SYSDATE, -6);
SELECT ename, hiredate, TO_CHAR(hiredate,'DY') AS day_of_week
FROM emp WHERE TO_CHAR(hiredate,'DY') IN ('SAT','SUN');
SELECT d.dname,
       ROUND(AVG(MONTHS_BETWEEN(SYSDATE, e.hiredate)),1) AS avg_experience_months
FROM emp e JOIN dept d ON e.deptno = d.deptno GROUP BY d.dname;

In [ ]:
-- Section 3: Time Zone Handling
SELECT FROM_TZ(TIMESTAMP '2025-10-05 08:00:00', 'America/New_York') AT TIME ZONE 'Asia/Kolkata' AS india_time FROM DUAL;
ALTER SESSION SET TIME_ZONE = '+02:00';
SELECT CURRENT_TIMESTAMP, SYSTIMESTAMP FROM DUAL;
SELECT CURRENT_DATE AS curr_date, CURRENT_TIMESTAMP AS curr_ts FROM DUAL;

In [ ]:
-- Section 4: Advanced Conversions
SELECT TO_TIMESTAMP('2025-10-05 15:45:33.123', 'YYYY-MM-DD HH24:MI:SS.FF3') AS converted_ts FROM DUAL;
SELECT CAST(SYSDATE AS TIMESTAMP) AS ts_value FROM DUAL;
SELECT EXTRACT(TIMEZONE_REGION FROM SYSTIMESTAMP) AS tz_region FROM DUAL;
SELECT SYSTIMESTAMP + NUMTODSINTERVAL(90,'MINUTE') AS after_90_min,
       SYSTIMESTAMP + NUMTOYMINTERVAL(2,'MONTH') AS after_2_months FROM DUAL;
SELECT TO_CHAR(SYSTIMESTAMP,'YYYY-MM-DD HH24:MI:SS.FF3 TZR') AS formatted_ts FROM DUAL;

In [ ]:
-- Section 5: Interview Challenges
SELECT (TO_TIMESTAMP('2025-10-05 18:00:00','YYYY-MM-DD HH24:MI:SS') -
        TO_TIMESTAMP('2025-10-05 14:00:00','YYYY-MM-DD HH24:MI:SS')) DAY TO SECOND AS diff FROM DUAL;
SELECT EXTRACT(DAY FROM (t2 - t1))*24*60 + EXTRACT(HOUR FROM (t2 - t1))*60 + EXTRACT(MINUTE FROM (t2 - t1)) AS diff_minutes
FROM (SELECT TO_TIMESTAMP('2025-10-05 18:00:00','YYYY-MM-DD HH24:MI:SS') t2,
             TO_TIMESTAMP('2025-10-05 15:00:00','YYYY-MM-DD HH24:MI:SS') t1 FROM DUAL);
SELECT ROUND(SYSTIMESTAMP, 'MI') AS rounded_minute FROM DUAL;
SELECT SYSTIMESTAMP + INTERVAL '45' DAY + INTERVAL '6' HOUR AS project_deadline FROM DUAL;
SELECT CASE WHEN TO_NUMBER(TO_CHAR(SYSTIMESTAMP,'HH24')) BETWEEN 9 AND 18 THEN 'Within Office Hours'
            ELSE 'Outside Office Hours' END AS status FROM DUAL;